import pytest
import morse


@pytest.mark.parametrize('s,exp', [
    (' ', ' '), # проблемы с кодированием пробелов
    ('--..--', ','),  # не правильно закодированная запятая
    ('----- .---- ..--- ...-- ....- ..... -.... --... ---.. ----.', '0123456789'),
    ('.. - .. ... -.-. .- -- . .-.. -....- -.-. .- ... . ..--..', 'ITISCAMEL-CASE?'),
    ('.... . .... ..', 'HE HI'),
    ('--- -----', 'O0'),
    ('', ''),
    ('-.--. ..--..   -..-. -..-.   .---- -....- -.--.-', '(? // 1:)')
])
def test_decode(s, exp):
    assert morse.decode(s) == exp
